ХамелионЦРПТ/src/InformationRegisters/ХН_СоответствиеОперациямВводВОборот/ХН_СоответствиеОперациямВводВОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХН_СоответствиеОперациямВводВОборот</name>
  <resources>
    <name>ОтчетОбИспользовании</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <dimensions>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/ХН_СоответствиеОперациямВводВОборот/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает данные ТТН по транспортной операции.
//
// Параметры:
//	ТранспортнаяОперация - Документ.ТранспортныеОперации - объект для которого необходимо определить вид ТТН.
//
// Возвращаемое значение:
//  Таблица значений - таблица, содержащая данные ТТН.
//		Имена колонок таблицы совпадают с именами полей регистра сведений.
//
Функция СоответствиеТранспортнойОперации(ТранспортнаяОперация) Экспорт
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ФТО_СоответствиеТранспортныхОперацийИТТН.Регистратор КАК ТранспортнаяОперация,
	//	|	ФТО_СоответствиеТранспортныхОперацийИТТН.НомерТТН КАК НомерТТН,
	//	|	ФТО_СоответствиеТранспортныхОперацийИТТН.ВидТТН КАК ВидТТН
	//	|ИЗ
	//	|	РегистрСведений.ФТО_СоответствиеТранспортныхОперацийИТТН КАК ФТО_СоответствиеТранспортныхОперацийИТТН
	//	|ГДЕ
	//	|	ФТО_СоответствиеТранспортныхОперацийИТТН.Регистратор = &ТранспортнаяОперация";
	//
	//Запрос.УстановитьПараметр("ТранспортнаяОперация", ТранспортнаяОперация);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//	
	//Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Возвращает данные о транспортной операции по номеру и виду ТТН.
//
// Параметры:
//	НомерТТН - Строка(12) - Номер ТТН
//	ВидТТН - Перечисление.ФТО_ВидыТТН - Вид ТТН.
//
// Возвращаемое значение:
//  Массив - массив, содержащий транспортные операции.
//
Функция ВводВоборотПоОтчетОбИспользовании(ОтчетОбИспользовании, МассивИсключений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХН_СоответствиеОперациямВводВОборот.ВводВОборот КАК ВводВОборот
		|ИЗ
		|	РегистрСведений.ХН_СоответствиеОперациямВводВОборот КАК ХН_СоответствиеОперациямВводВОборот
		|ГДЕ
		|	ХН_СоответствиеОперациямВводВОборот.ОтчетОбИспользовании = &ОтчетОбИспользовании
		|	И НЕ ХН_СоответствиеОперациямВводВОборот.ВводВОборот В (&МассивИсключений)";
	
	Запрос.УстановитьПараметр("МассивИсключений", МассивИсключений);
	Запрос.УстановитьПараметр("ОтчетОбИспользовании", ОтчетОбИспользовании);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВводВОборот = РезультатЗапроса.Выгрузить();  
	
	Возврат ВводВОборот.ВыгрузитьКолонку("ВводВОборот");;
	
КонецФункции

#КонецОбласти
